
&НаКлиенте
АСИНХ Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//@skip-check Undefined function
	НазваниеТовара = Ждать ВвестиСтрокуАсинх("", "Введи название товара"); 
	
	Если ПроверитьСуществованиеТовара(НазваниеТовара) Тогда
		ТекстСообщения = СтрШаблон("Товар %1 найден!", НазваниеТовара);
	Иначе
		ТекстСообщения = СтрШаблон("Товар %1 не найден!", НазваниеТовара);
	КонецЕсли;
	
	//@skip-check use-non-recommended-method
	Сообщить(ТекстСообщения);
	
КонецПроцедуры

//@skip-check module-structure-method-in-regions
&НаСервере
Функция ПроверитьСуществованиеТовара(НазваниеТовара)
	ТоварСуществует = Справочники.Товары.ПроверитьСуществованиеПоНазванию(НазваниеТовара);
	Возврат ТоварСуществует;
КонецФункции